#### MetallicpaintTopcoatType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "MetallicpaintTopcoat" from the "MetallicPaint" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum MetallicpaintTopcoatType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration MetallicpaintTopcoatType ``` |

| Visual C++ |
| --- |
| ``` public enum class MetallicpaintTopcoatType ``` |

# Members

| Member name | Description |
| --- | --- |
| Carpaint |  |
| Chrome |  |
| Matte |  |
| Custom |  |

# See Also

Autodesk.Revit.DB.Visual Namespace